---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewAnalysisDisplayStyle
source: html/2959e045-8701-ca28-e4ae-21a9e97b2e73.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewAnalysisDisplayStyle Property

"Default Analysis Display Style"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewAnalysisDisplayStyle { get; }
```